In [1]:
%load_ext sql
%config SqlMagic.autopandas=False

/home/juliano/anaconda3/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

## Connection Config
Load the following environment variables in the shell:

 - $PG_USERNAME
 
 - $PG_PASSWORD
 
 -  $PG_HOST
 
 - $PG_DATABASE

You can do it with this command (run in your terminal!):

$ **env PG_USERNAME="" PG_PASSWORD="" PG_HOST=""  PG_DATABASE="" jupyter notebook**

for example:

$ **env PG_USERNAME="postgres" PG_PASSWORD="postgres" PG_HOST="localhost" PG_DATABASE="school" jupyter notebook**

OBS: If you already started jupyter notebook but didn't used the command above, turn off the server and do it again.

In [2]:
import os
import pwd
sqla_conn = os.getenv('SQLA_CONN') or \
    'postgresql://%s:%s@%s/%s' % (os.getenv('PG_USERNAME') or '', os.getenv('PG_PASSWORD') or '',
                                  os.getenv('PG_HOST') or '', 
                                  os.getenv('PG_DATABASE') or pwd.getpwuid(os.getuid()).pw_name)
sqla_conn = "postgresql://postgres:postgres@localhost/parlgov"

print("Connection is to " + sqla_conn)

Connection is to postgresql://postgres:postgres@localhost/parlgov

In [3]:
%sql $sqla_conn

'Connected: postgres@parlgov'

# Using the database

In [5]:
%%sql

 * postgresql://postgres:***@localhost/parlgov
0 rows affected.

[]

### Show schema

The command below uses the *pgspecial* python package, make sure your have it installed

In [6]:
%%sql
\d

 * postgresql://postgres:***@localhost/school
4 rows affected.

[('university', 'course', 'table', 'postgres'),
 ('university', 'offering', 'table', 'postgres'),
 ('university', 'student', 'table', 'postgres'),
 ('university', 'took', 'table', 'postgres')]

## Inserting data

The command below manually inserts data into our database

In [17]:
%%sql
insert into Student values (99132, 'Avery', 'Marchmount', 'StG', 'avery@cs', 3.13);
insert into Student values (98000, 'William', 'Fairgrieve', 'StG', 'will@cs', 4.00);
insert into Student values (99999, 'Afsaneh', 'Ali', 'UTSC', 'aali@cs', 2.98);
insert into Student values (00157, 'Leilani', 'Lakemeyer', 'UTM', 'lani@cs', 3.42);
insert into Student values (11111, 'Homer', 'Simpson', 'StG', 'doh@gmail', 0.4);

insert into Course values (343, 'Intro to Databases', 'CSC', false);
insert into Course values (207, 'Software Design', 'CSC', false);
insert into Course values (148, 'Intro to Comp Sci', 'CSC', false);
insert into Course values (263, 'Data Struct & Anal', 'CSC', false);
insert into Course values (320, 'Intro to Visual Computing', 'CSC', false);
insert into Course values (200, 'Intro Archaeology', 'ANT', true);
insert into Course values (203, 'Human Biol & Evol', 'ANT', false);
insert into Course values (150, 'Organisms in Environ', 'EEB', false);
insert into Course values (216, 'Marine Mammal Bio', 'EEB', false);
insert into Course values (263, 'Compar Vert Anatomy', 'EEB', false);
insert into Course values (110, 'Narrative', 'ENG', true);
insert into Course values (205, 'Rhetoric', 'ENG', true);
insert into Course values (235, 'The Graphic Novel', 'ENG', true);
insert into Course values (200, 'Environmental Change', 'ENV', false);
insert into Course values (320, 'Natl & Intl Env Policy', 'ENV', false);
insert into Course values (220, 'Mediaeval Society', 'HIS', true);
insert into Course values (296, 'Black Freedom', 'HIS', true);
insert into Course values (222, 'COBOL programming', 'CSC', false);

insert into Offering values (1, 343, 'CSC', 20089, 'Horton');
insert into Offering values (2, 343, 'CSC', 20089, 'Truta');
insert into Offering values (3, 343, 'CSC', 20089, 'Heap');
insert into Offering values (4, 320, 'CSC', 20089, 'Jepson');
insert into Offering values (5, 207, 'CSC', 20089, 'Craig');
insert into Offering values (6, 207, 'CSC', 20089, 'Gries');
insert into Offering values (7, 148, 'CSC', 20089, 'Jepson');
insert into Offering values (8, 148, 'CSC', 20089, 'Chechik');
insert into Offering values (9, 263, 'CSC', 20089, 'Horton');
insert into Offering values (11, 200, 'ANT', 20089, 'Zorich');
insert into Offering values (12, 203, 'ANT', 20089, 'Davies');
insert into Offering values (13, 263, 'EEB', 20089, 'Johancsik');
insert into Offering values (14, 235, 'ENG', 20089, 'Percy');
insert into Offering values (15, 205, 'ENG', 20089, 'Reisman');
insert into Offering values (16, 110, 'ENG', 20089, 'Atwood');
insert into Offering values (17, 320, 'ENV', 20089, 'Suzuki');
insert into Offering values (18, 220, 'HIS', 20089, 'Young');
insert into Offering values (19, 220, 'HIS', 20089, 'Dow');

insert into Offering values (21, 343, 'CSC', 20081, 'Mylopoulos');
insert into Offering values (22, 343, 'CSC', 20081, 'Mylopoulos');
insert into Offering values (23, 263, 'CSC', 20081, 'Craig');
insert into Offering values (24, 320, 'CSC', 20081, 'Jepson');
insert into Offering values (25, 207, 'CSC', 20081, 'Craig');
insert into Offering values (26, 207, 'CSC', 20081, 'Gries');
insert into Offering values (27, 148, 'CSC', 20081, 'Jepson');
insert into Offering values (28, 148, 'CSC', 20081, 'Miller');
insert into Offering values (29, 263, 'CSC', 20081, 'Horton');
insert into Offering values (31, 203, 'ANT', 20081, 'Zorich');
insert into Offering values (32, 216, 'EEB', 20081, 'Suzuki');
insert into Offering values (33, 263, 'EEB', 20081, 'Suzuki');
insert into Offering values (34, 150, 'EEB', 20081, 'Mendel');
insert into Offering values (35, 110, 'ENG', 20081, 'Percy');
insert into Offering values (36, 200, 'ENV', 20081, 'Suzuki');
insert into Offering values (37, 205, 'ENG', 20081, 'Atwood');
insert into Offering values (38, 235, 'ENG', 20081, 'Richler');
insert into Offering values (39, 296, 'HIS', 20081, 'Young');

insert into Took values (99132, 1, 79);
insert into Took values (99132, 16, 98);
insert into Took values (99132, 31, 82);
insert into Took values (99132, 11, 99);
insert into Took values (99132, 14, 39);
insert into Took values (99132, 15, 62);
insert into Took values (99132, 34, 75);

insert into Took values (98000, 11, 79);
insert into Took values (98000, 1, 82);
insert into Took values (98000, 5, 89);
insert into Took values (98000, 6, 72);
insert into Took values (98000, 7, 89);
insert into Took values (98000, 8, 93);
insert into Took values (98000, 13, 98);
insert into Took values (98000, 16, 79);
insert into Took values (98000, 17, 79);
insert into Took values (98000, 22, 54);
insert into Took values (98000, 27, 89);
insert into Took values (98000, 31, 78);
insert into Took values (98000, 38, 92);
insert into Took values (98000, 39, 97);
insert into Took values (98000, 9, 78);

insert into Took values (99999, 11, 99);
insert into Took values (99999, 1, 89);
insert into Took values (99999, 5, 76);
insert into Took values (99999, 6, 78);
insert into Took values (99999, 7, 71);
insert into Took values (99999, 8, 91);
insert into Took values (99999, 13, 99);
insert into Took values (99999, 16, 100);
insert into Took values (99999, 17, 94);
insert into Took values (99999, 22, 96);
insert into Took values (99999, 27, 52);
insert into Took values (99999, 31, 70);

insert into Took values (00157, 1, 99);
insert into Took values (00157, 14, 98);
insert into Took values (00157, 31, 82);
insert into Took values (00157, 21, 71);
insert into Took values (00157, 11, 39);
insert into Took values (00157, 34, 62);
insert into Took values (00157, 35, 75);
insert into Took values (00157, 3, 82);
insert into Took values (00157, 5, 59);
insert into Took values (00157, 6, 72);
insert into Took values (00157, 7, 89);
insert into Took values (00157, 28, 91);
insert into Took values (00157, 13, 90);
insert into Took values (00157, 26, 71);
insert into Took values (00157, 17, 59);

insert into Took values (11111, 17, 46);
insert into Took values (11111, 14, 40);
insert into Took values (11111, 15, 0);
insert into Took values (11111, 16, 17);
insert into Took values (11111, 34, 45);

 * postgresql://postgres:***@localhost/school
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Queries

Now we can write usual queries, and the result will be displayed using the **pandas** library!

In [48]:
%%sql
SELECT *
FROM Student
LIMIT 3;

 * postgresql://postgres:***@localhost/school
3 rows affected.

[(99132, 'Avery', 'Marchmount', 'StG', 'avery@cs', Decimal('3.13')),
 (98000, 'William', 'Fairgrieve', 'StG', 'will@cs', Decimal('4.00')),
 (99999, 'Afsaneh', 'Ali', 'UTSC', 'aali@cs', Decimal('2.98'))]

## Questions

### GROUP BY / HAVING

- Write a query to find the average grade, minimum grade, and maximum grade for each offering.

In [8]:
%%sql
SELECT oid, avg(grade), min(grade), max(grade)
FROM Took
GROUP BY oid;

 * postgresql://postgres:***@localhost/school
23 rows affected.

[(8, Decimal('92.0000000000000000'), 91, 93),
 (16, Decimal('73.5000000000000000'), 17, 100),
 (28, Decimal('91.0000000000000000'), 91, 91),
 (15, Decimal('31.0000000000000000'), 0, 62),
 (1, Decimal('87.2500000000000000'), 79, 99),
 (26, Decimal('71.0000000000000000'), 71, 71),
 (13, Decimal('95.6666666666666667'), 90, 99),
 (22, Decimal('75.0000000000000000'), 54, 96),
 (27, Decimal('70.5000000000000000'), 52, 89),
 (21, Decimal('71.0000000000000000'), 71, 71),
 (5, Decimal('74.6666666666666667'), 59, 89),
 (11, Decimal('79.0000000000000000'), 39, 99),
 (39, Decimal('97.0000000000000000'), 97, 97),
 (3, Decimal('82.0000000000000000'), 82, 82),
 (14, Decimal('59.0000000000000000'), 39, 98),
 (17, Decimal('69.5000000000000000'), 46, 94),
 (31, Decimal('78.0000000000000000'), 70, 82),
 (35, Decimal('75.0000000000000000'), 75, 75),
 (34, Decimal('60.6666666666666667'), 45, 75),
 (9, Decimal('78.0000000000000000'), 78, 78),
 (38, Decimal('92.0000000000000000'), 92, 92),
 (6, Decimal('74.0000000000000000'), 72, 78),
 (7, Decimal('83.0000000000000000'), 71, 89)]

- Find the sid and minimum grade of each student with an average over 80.

In [26]:
%%sql
SELECT sid, min(grade)
FROM Took
GROUP BY sid
HAVING avg(grade) > 80;

 * postgresql://postgres:***@localhost/school
2 rows affected.

[(98000, 54), (99999, 52)]

- Find the sid, surname, and average grade of each student, but keep the data only for those students who have taken at least 10 courses.

*I'll assume that the student could've taken the same course twice, and this counts towards the minimum of 10 courses*

In [27]:
%%sql
SELECT Student.sid, Student.surname, avg(grade)
FROM Student, Took
WHERE Student.sid = Took.sid
GROUP BY Student.sid
HAVING count(*) >= 10;

 * postgresql://postgres:***@localhost/school
3 rows affected.

[(98000, 'Fairgrieve', Decimal('83.2000000000000000')),
 (99999, 'Ali', Decimal('84.5833333333333333')),
 (157, 'Lakemeyer', Decimal('75.9333333333333333'))]

- For each student who has passed at least 10 courses, report their sid and average grade on the courses that they passed.

In [28]:
%%sql
SELECT sid, avg(grade)
FROM Took
WHERE grade >= 50
GROUP BY sid
HAVING count(*) >= 10;

 * postgresql://postgres:***@localhost/school
3 rows affected.

[(98000, Decimal('83.2000000000000000')),
 (99999, Decimal('84.5833333333333333')),
 (157, Decimal('78.5714285714285714'))]

- For each student who has passed at least 10 courses, report their sid and average grade on all of their courses.

In [32]:
%%sql
CREATE OR REPLACE VIEW PassedAtLeastTen AS
    SELECT DISTINCT sid
    FROM Took
    WHERE grade >= 50
    GROUP BY sid
    HAVING count(*) >= 10;
    
SELECT Took.sid, avg(grade)
FROM PassedAtLeastTen as pTen, Took
WHERE pTen.sid = Took.sid
GROUP BY Took.sid;

 * postgresql://postgres:***@localhost/school
Done.
3 rows affected.

[(98000, Decimal('83.2000000000000000')),
 (99999, Decimal('84.5833333333333333')),
 (157, Decimal('75.9333333333333333'))]

### GROUP BY / HAVING
- Find all terms when Jepson and Suzuki were both teaching. Include every ocurrence of a term from the result of both operands.

In [37]:
%%sql
(SELECT term FROM Offering WHERE instructor = 'Jepson')
INTERSECT ALL
(SELECT term FROM Offering WHERE instructor = 'Suzuki');

 * postgresql://postgres:***@localhost/school
3 rows affected.

[(20089,), (20081,), (20081,)]

- Find the sID of students who have earned a grade of 86 or more in some course, or who have passed a course taught by Atwood. Ensure that no sID occurs twice in the result.

In [45]:
%%sql
(SELECT DISTINCT sid FROM Took WHERE grade >= 85)
UNION
(SELECT DISTINCT sid
 FROM Took, Offering
 WHERE Took.oid = Offering.oid AND instructor = 'Atwood' AND grade >= 85);

 * postgresql://postgres:***@localhost/school
4 rows affected.

[(98000,), (99132,), (99999,), (157,)]

### OUTER JOINS
- For each student who has taken a course, report their sid and the number of different departments they have taken a course in.

In [21]:
%%sql
SELECT sid, count(DISTINCT dept)
FROM Took JOIN Offering USING (oid)
GROUP BY sid;

 * postgresql://postgres:***@localhost/school
5 rows affected.

[(157, 5), (11111, 3), (98000, 6), (99132, 4), (99999, 5)]

In [23]:
%%sql
create table One(
    a integer,
    b integer);

create table Two(
    b integer,
    c integer);

insert into One values (1, 2);
insert into One values (6, 12);
insert into One values (NULL, 100);
insert into One values (20, NULL);

insert into Two values (2, 3);
insert into Two values (100, 101);
insert into Two values (20, 21);
insert into Two values (2, 4);
insert into Two values (2, 5);

 * postgresql://postgres:***@localhost/school
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [23]:
%%sql
SELECT *
FROM One;

 * postgresql://postgres:***@localhost/school
4 rows affected.

[(1, 2), (6, 12), (None, 100), (20, None)]

In [25]:
%%sql
SELECT *
FROM Two;

 * postgresql://postgres:***@localhost/school
5 rows affected.

[(2, 3), (100, 101), (20, 21), (2, 4), (2, 5)]

Some examples of using OUTER JOINS:

In [30]:
%%sql
SELECT a, b, c FROM One RIGHT JOIN Two USING(b);

 * postgresql://postgres:***@localhost/school
5 rows affected.

[(1, 2, 3), (1, 2, 4), (1, 2, 5), (None, 20, 21), (None, 100, 101)]

In [31]:
%%sql
SELECT a, b, c FROM One LEFT JOIN Two USING(b);

 * postgresql://postgres:***@localhost/school
6 rows affected.

[(1, 2, 3),
 (1, 2, 4),
 (1, 2, 5),
 (6, 12, None),
 (None, 100, 101),
 (20, None, None)]

### SUBQUERIES
- What does this query do?

```SQL
SELECT sid, dept||cnum as course, grade
FROM Took,
     (SELECT *
      FROM Offering
      WHERE instructor = 'Horton') Hoffering
WHERE Took.oid = Hoffering.oid;
```

Ans: Get the *sid*, *course* and *grade* of every student who took an oferring which instructor was Horton.

In [21]:
%%sql
SELECT sid, dept||cnum as course, grade
FROM Took,
     (SELECT *
      FROM Offering
      WHERE instructor = 'Horton') Hoffering
WHERE Took.oid = Hoffering.oid;

 * postgresql://postgres:***@localhost/school
5 rows affected.

[(99132, 'CSC343', 79),
 (98000, 'CSC343', 82),
 (98000, 'CSC263', 78),
 (99999, 'CSC343', 89),
 (157, 'CSC343', 99)]

```SQL
SELECT sid, surname
FROM Student
WHERE cgpa > 
      (SELECT cgpa
       FROM Student
       WHERE sid = 99999);
```

Ans: Get the *sid*, *surname* of every student whose cgpa was greater than the cgpa of the student with sid = 99999.

In [22]:
%%sql
SELECT sid, surname
FROM Student
WHERE cgpa > 
      (SELECT cgpa
       FROM Student
       WHERE sid = 99999);

 * postgresql://postgres:***@localhost/school
3 rows affected.

[(99132, 'Marchmount'), (98000, 'Fairgrieve'), (157, 'Lakemeyer')]

- What does this query do?

```SQL
SELECT sid, dept||cnum as course, grade
FROM Took JOIN Offering ON Took.oid = Offering.oid
WHERE 
    grade >= 80 AND
    (cnum, dept) IN (
           SELECT cnum, dept
           FROM Took JOIN Offering ON Took.oid = Offering.oid
                     JOIN Student ON Took.sid = Student.sid
           WHERE surname = 'Lakemeyer');
```

Ans: Get the *sid*, *course* and *grade* of every student which has taken a course with grade over 80 in a course that Lakemeyer took.

In [36]:
%%sql
SELECT sid, dept||cnum as course, grade
FROM Took JOIN Offering ON Took.oid = Offering.oid
WHERE 
    grade >= 80 AND
    (cnum, dept) IN (
           SELECT cnum, dept
           FROM Took JOIN Offering ON Took.oid = Offering.oid
                     JOIN Student ON Took.sid = Student.sid
           WHERE surname = 'Lakemeyer');

 * postgresql://postgres:***@localhost/school
24 rows affected.

[(157, 'CSC343', 99),
 (99999, 'CSC343', 89),
 (98000, 'CSC343', 82),
 (157, 'CSC343', 82),
 (98000, 'CSC207', 89),
 (157, 'CSC148', 89),
 (98000, 'CSC148', 89),
 (99999, 'CSC148', 91),
 (98000, 'CSC148', 93),
 (99999, 'ANT200', 99),
 (99132, 'ANT200', 99),
 (157, 'EEB263', 90),
 (99999, 'EEB263', 99),
 (98000, 'EEB263', 98),
 (157, 'ENG235', 98),
 (99999, 'ENG110', 100),
 (99132, 'ENG110', 98),
 (99999, 'ENV320', 94),
 (99999, 'CSC343', 96),
 (98000, 'CSC148', 89),
 (157, 'CSC148', 91),
 (157, 'ANT203', 82),
 (99132, 'ANT203', 82),
 (98000, 'ENG235', 92)]

- Suppose we have these relations: One(a, b) and Two(b, c). What does this query do?

```SQL
SELECT a
FROM One
WHERE b IN (SELECT b FROM Two);
```

Ans = Gets all the values of **a** from R such that the **b** value in the same row appears somewhere in S.

In [30]:
%%sql
SELECT a
FROM One
WHERE b IN (SELECT b FROM Two);

 * postgresql://postgres:***@localhost/school
2 rows affected.

[(1,), (None,)]

To express the last query without using subqueries, we could do:

```SQL
SELECT DISTINCT a
FROM One JOIN Two USING(b);
```

In [25]:
%%sql
SELECT a
FROM One JOIN Two USING(b);

 * postgresql://postgres:***@localhost/school
4 rows affected.

[(1,), (1,), (1,), (None,)]

- What does this query do?

```SQL
SELECT instructor
FROM Offering Off1
WHERE NOT EXISTS (
    SELECT *
    FROM Offering
    WHERE
        oid <> Off1.oid AND
        instructor = Off1.instructor);
```

Ans = Get all the instructors who offered **only** one time.

In [45]:
%%sql
SELECT instructor
FROM Offering Off1
WHERE NOT EXISTS (
    SELECT *
    FROM Offering
    WHERE
        oid <> Off1.oid AND
        instructor = Off1.instructor)
ORDER BY instructor;

 * postgresql://postgres:***@localhost/school
10 rows affected.

[('Chechik',),
 ('Davies',),
 ('Dow',),
 ('Heap',),
 ('Johancsik',),
 ('Mendel',),
 ('Miller',),
 ('Reisman',),
 ('Richler',),
 ('Truta',)]

- What does this query do?

```SQL
SELECT DISTINCT oid
FROM Took
WHERE EXISTS (
    SELECT *
    FROM Took t, Offering o
    WHERE
        t.oid = o.oid AND
        t.oid <> Took.oid AND
        o.dept = 'CSC' AND
        took.sid = t.sid)
ORDER BY oid;
```

Ans = Get all offerings that students who have also taken CSC courses more than once have also taken. (Try to imagine what the query would return if a student only took one course in CSC).

In [50]:
%%sql
SELECT DISTINCT oid
FROM Took
WHERE EXISTS (
    SELECT *
    FROM Took t, Offering o
    WHERE
        t.oid = o.oid AND
        t.oid <> Took.oid AND
        o.dept = 'CSC' AND
        took.sid = t.sid)
ORDER BY oid;

 * postgresql://postgres:***@localhost/school
23 rows affected.

[(1,),
 (3,),
 (5,),
 (6,),
 (7,),
 (8,),
 (9,),
 (11,),
 (13,),
 (14,),
 (15,),
 (16,),
 (17,),
 (21,),
 (22,),
 (26,),
 (27,),
 (28,),
 (31,),
 (34,),
 (35,),
 (38,),
 (39,)]

- For each course, that is, each department and course number combination, find the instructor who has taught the most offerings of it. If there are ties, include them all. Report the course (eg "csc343"), instructor and the number of offerings of the course by that instructor.

a) Let's create a view called Counts to hold, for each course, and each instructor who has taught it, their number of offering.

In [31]:
%%sql
CREATE OR REPLACE VIEW Counts AS
SELECT instructor, dept||cnum as course, count(*) as number_times
FROM Offering
GROUP BY dept, cnum, instructor;

 * postgresql://postgres:***@localhost/school
Done.

[]

b) Now let's solve the problem without using any join, just subqueries

In [32]:
%%sql
SELECT *
FROM Counts
WHERE number_times >= (
      SELECT max(number_times)
      FROM Counts as C
      WHERE Counts.instructor <> C.instructor AND
            Counts.course = C.course);

 * postgresql://postgres:***@localhost/school
17 rows affected.

[('Young', 'HIS220', 1),
 ('Reisman', 'ENG205', 1),
 ('Mylopoulos', 'CSC343', 2),
 ('Craig', 'CSC207', 2),
 ('Percy', 'ENG235', 1),
 ('Suzuki', 'EEB263', 1),
 ('Atwood', 'ENG110', 1),
 ('Gries', 'CSC207', 2),
 ('Atwood', 'ENG205', 1),
 ('Jepson', 'CSC148', 2),
 ('Dow', 'HIS220', 1),
 ('Davies', 'ANT203', 1),
 ('Zorich', 'ANT203', 1),
 ('Percy', 'ENG110', 1),
 ('Johancsik', 'EEB263', 1),
 ('Horton', 'CSC263', 2),
 ('Richler', 'ENG235', 1)]

 - Use **EXISTS** to find the surname and email address of students who have never taken a CSC course.

In [70]:
%%sql
 SELECT surname, email
 FROM Student
 WHERE NOT EXISTS (
       SELECT *
       FROM Took JOIN Offering USING(oid)
       WHERE Student.sid = Took.sid AND
             dept = 'CSC');

 * postgresql://postgres:***@localhost/school
3 rows affected.

[('Simpson', 'doh@gmail'), ('Ali', 'topkek@cs'), ('Ali', 'aali@cs')]

- Use **EXISTS** to find every instructor who has given a grade of 100.

In [73]:
%%sql

SELECT DISTINCT instructor
FROM Offering
WHERE EXISTS (
      SELECT
      FROM Offering as O JOIN Took USING(oid)
      WHERE Offering.instructor = O.instructor AND
            grade = 100);

 * postgresql://postgres:***@localhost/school
1 rows affected.

[('Atwood',)]

- Let's say that a course has level "junior" if its cnum is between 100 and 299 inclusive, and has level "senior" if its cnum is between 300 and 499 incluse. Report the average grade, across all departments and course offerings, for all junior courses and for all senior courses. Report your answer in a table that looks like this:


| level        | levelavg
| -------------|:-------------:|
| junior      | -|
| senior      | -|

- Each average should be an average of the individual student grades, not an average of the course averages.

In [93]:
%%sql
(SELECT 'junior' as level, avg(grade) as levelavg
 FROM (SELECT oid
       FROM Offering
       WHERE cnum >= 100 AND cnum <= 299) as JuniorCourses JOIN Took USING(oid))
UNION ALL
(SELECT 'senior' as level, avg(grade) as levelavg
 FROM  (SELECT oid
        FROM Offering
        WHERE cnum >= 300 AND cnum <= 499) SeniorCourses JOIN Took USING(oid));

 * postgresql://postgres:***@localhost/school
2 rows affected.

[('junior', Decimal('75.0952380952380952')),
 ('senior', Decimal('77.5000000000000000'))]

 * postgresql://postgres:***@localhost/school
2 rows affected.

[(14, 'low'), (15, 'low')]